app/Models/JoinModel.php

    public function showAddressDeliveryman($cd_entregador = null)
    {
        $builder = $this->db->table('entregador');
        $builder->select('entregador.cd_entregador, entregador.nm_entregador as nome, entregador.dt_nascimento as nascimento, entregador.ds_email as email, endereco.cep as cep, endereco.bairro as bairro, endereco.cidade as cidade, endereco.uf as uf, endereco.cidade as cidade');
        $builder->join('endereco', 'endereco.cd_endereco = endereco.cd_endereco');

        if(!empty($cd_entregador)){

            $builder->where('entregador.cd_entregador', $cd_entregador);

        }

        $query = $builder->get();
---
SELECT `entregador`.`cd_entregador`, `entregador`.`nm_entregador` as `nome`, `entregador`.`dt_nascimento` as `nascimento`, `entregador`.`ds_email` as `email`, `endereco`.`cep` as `cep`, `endereco`.`bairro` as `bairro`, `endereco`.`cidade` as `cidade`, `endereco`.`uf` as `uf`, `endereco`.`cidade` as `cidade`
FROM `entregador`
JOIN `endereco` ON `endereco`.`cd_endereco` = `endereco`.`cd_endereco`
WHERE `entregador`.`cd_entregador` = '38'

    public function deleteAddressDeliveryman($cd_entregador = null)
    {

        $builder = $this->db->table('entregador');
        $builder->select('entregador.cd_entregador, entregador.nm_entregador as nome, entregador.dt_nascimento as nascimento, entregador.ds_email as email, endereco.cep as cep, endereco.bairro as bairro, endereco.cidade as cidade, endereco.uf as uf');
        $builder->join('endereco', 'endereco.cd_endereco = endereco.cd_endereco');
        $query = $builder->get();

        if(!empty($cd_entregador)){

            $builder->where('entregador.cd_entregador', $cd_entregador);
            $builder->delete();
---
SELECT `entregador`.`cd_entregador`, `entregador`.`nm_entregador` as `nome`, `entregador`.`dt_nascimento` as `nascimento`, `entregador`.`ds_email` as `email`, `endereco`.`cep` as `cep`, `endereco`.`bairro` as `bairro`, `endereco`.`cidade` as `cidade`, `endereco`.`uf` as `uf`
FROM `entregador`
JOIN `endereco` ON `endereco`.`cd_endereco` = `endereco`.`cd_endereco`
DELETE FROM `entregador`
WHERE `entregador`.`cd_entregador` = '39'

    public function editAddressDeliveryman($data)
    {

        //table entregador
        $builder = $this->db->table('entregador');
        $builder->update($data['entregador'], ['cd_entregador' => $data['entregador']['cd_entregador']]);

        //table endereco
        $builder = $this->db->table('endereco');
        $builder->update($data['endereco'], ['cd_entregador' => $data['entregador']['cd_entregador']]);
---
UPDATE `entregador` SET `cd_entregador` = '38', `nm_entregador` = 'mariana salles de abreu morreu pppp', `dt_nascimento` = '2000-02-02', `ds_email` = 'mrrobot3004@hotmail.com'
WHERE `cd_entregador` = '38'
UPDATE `endereco` SET `cep` = '41320010', `bairro` = 'Castelo Branco', `cidade` = 'Salvador', `uf` = 'BA', `endereco` = ''
WHERE `cd_entregador` = '38'